///یک تابع برای تبدیل شماره‌ها و برخی حروف در زبان‌های فارسی، عربی و انگلیسی به همدیگر
String convertNumber(String text, String language) {
  // دیکشنری‌ها در یک Map کلی
  const Map<String, Map<String, String>> languageMaps = {
    'fa-en': {'۰': '0', '۱': '1', '۲': '2', '۳': '3', '۴': '4', '۵': '5', '۶': '6', '۷': '7', '۸': '8', '۹': '9', '،': ',', '؟': '?', '؛': ';', '٪': '%'},
    'fa-ar': {'۴': '٤', '۶': '٦', 'ی': 'ي', 'ک': 'ك'},
    'en-fa': {'0': '۰', '1': '۱', '2': '۲', '3': '۳', '4': '۴', '5': '۵', '6': '۶', '7': '۷', '8': '۸', '9': '۹', ',': '،', '?': '؟', ';': '؛', '%': '٪'},
    'en-ar': {'0': '۰', '1': '۱', '2': '۲', '3': '۳', '4': '٤', '5': '۵', '6': '٦', '7': '۷', '8': '۸', '9': '۹', ',': '،', '?': '؟', ';': '؛', '%': '٪'},
    'ar-fa': {'٤': '۴', '٦': '۶', 'ي': 'ی', 'ك': 'ک'},
    'ar-en': {'۰': '0', '۱': '1', '۲': '2', '۳': '3', '٤': '4', '۵': '5', '٦': '6', '۷': '7', '۸': '8', '۹': '9', '،': ',', '؟': '?', '؛': ';', '٪': '%'}
  };

  // پیدا کردن دیکشنری مربوطه
  final selectedMap = languageMaps[language];

  // اگر دیکشنری برای زبان وجود ندارد، همان متن را برمی‌گردانیم
  if (selectedMap == null) return text;

  // استفاده از StringBuffer برای بهینه‌تر کردن عملیات جایگزینی
  StringBuffer buffer = StringBuffer();

  // جایگزینی هر کاراکتر در متن با استفاده از دیکشنری
  for (int i = 0; i < text.length; i++) {
    // جایگزینی کاراکتر با استفاده از دیکشنری یا نگه داشتن همان کاراکتر اگر موجود نباشد
    buffer.write(selectedMap[text[i]] ?? text[i]);
  }
  return buffer.toString();
}